"""
Помилки (номери рядків через пробіл, цей рядок - №2): !!!
"""


def f(x):
    """Повернути значення функції.

    Функція не обробляє винятки.
    """
    return x**2 / (x + 2) - 3

try:
    k = int(input("Введіть межу інтервалу [-k; k]: "))
    h = float(input("Введіть крок: "))

    x = -k
    print("x".rjust(10), "f(x)".rjust(10))
    while x <= k:
        # Якщо помилка виникає під час обчислення функції,
        # Необхідно вивести тире "-"
        # Цей випадок повинен обробити другий вкладений блок try
        try:
            print(f"{x:10.2f} {f(x):10.2f}")
        except ZeroDivisionError:
            print(f"{x:10.2f} {'-':>10}")

        x += h
except ValueError:
    print("Помилка: введено некоректне значення. Будь ласка, введіть число.")
except Exception as e:
    print(f"Сталася помилка: {e}")